

# format
a = 'input:{},output:{}'.format("吃饭了吗", "小明")
print(a)

'''
新方法（f-string）
从Python 3.6开始，f-string是格式化字符串的一种很好的新方法。与其他格式化方式相比，它们不仅更易读，更简洁，不易出错，而且速度更快！

使用方法：
1、在字符串前面加上 f。

2、在字符串内部，将需要连接的变量用 {} 括起来即可。

特点
1、综合了上面三种老方法的优点，代码简洁，且变量名多的时候，不需要去数数，也没有繁琐的单引号双引号

2、括号{}里面的变量，可以是字符串类型，也可以是整型、浮点型，或者是复杂类型，比如数组、词典等，会自动转换成成字符串形式。

3、括号{}里面还可以是函数，比如 f'数组a的长度为:{len(a)}'。一句话，只要是位于 {} 中的，都会当做 python 代码来执行。但里面只能写表达式，不能写执行语句如{a=2}之类的。

4、f-string在本质上并不是字符串常量，而是一个在运行时运算求值的表达式
'''
# 示例：
a = f'input:{input},output:{output}'